Documents/СторнированиеМНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СторнированиеМНО</Name>
			<BasedOn>
				<xr:Item>Document.МНО</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваМНО</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МНО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МНО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредстваМНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваМНО</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МНО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МНО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccountingRegisters/БухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccountingRegister>
		<Properties>
			<Name>БухгалтерскийУчет</Name>
			<ChartOfAccounts>ChartOfAccounts.Основной</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Основной.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Основной.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОпераций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиБухгалтерскогоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Documents/МНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>МНО</Name>
			<BasedOn>
				<xr:Item>Document.Распоряжение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредстваМНО</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Распоряжение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/СчетаДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СчетаДоверительногоУправления</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>Числовая часть кода счета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчетаДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСчетовДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасторжения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичныйКабинет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециализированныйДепозитарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КалендарьКотировок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиКонсолидированныйБухгалтерскийУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораПоУправлениюПенсионнымиНакоплениямиИРезервами</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровПоУправлениюПенсионнымиНакоплениямиИРезервами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеИспользованияЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасчетныеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/СторнированиеМНО/Ext/ObjectModule.bsl
Процедура УстановитьБлокировки()
	
	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДенежныеСредстваМНО");
	ЭлементБлокировки.УстановитьЗначение("МНО", ЭтотОбъект.МНО);
	
	Блокировка.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировки

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();

	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.ДенежныеСредстваМНО.Записывать = Истина;
	
	// сторнирование сумм
	Движение = Движения.ДенежныеСредстваМНО.ДобавитьПриход();
	
	Движение.Период                       = ЭтотОбъект.Дата;
	Движение.Организация  				  = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	Движение.РасчетныйСчет 				  = ЭтотОбъект.МНО.РасчетныйСчет;
	Движение.МНО 					 	  = ЭтотОбъект.МНО;
	Движение.Сумма 						  = -ЭтотОбъект.МНО.Сумма;
	
	Движение = Движения.ДенежныеСредстваМНО.ДобавитьРасход();
	
	Движение.Период                       = ЭтотОбъект.МНО.ДатаВозврата;
	Движение.Организация  				  = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	Движение.РасчетныйСчет 				  = ЭтотОбъект.МНО.РасчетныйСчет;
	Движение.МНО 					 	  = ЭтотОбъект.МНО;
	Движение.Сумма 						  = -ЭтотОбъект.МНО.Сумма;

КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Функция ОтсторнироватьКорректировку()

	СуммаСторнированияКорректировки = 0;
	
	// сторнирование корректировки
	УчетныйАктив	= Справочники.УчетныеАктивыЕПС.ПроцентыНаМНО;
	
	БанковскийСчет = ЭтотОбъект.МНО.РасчетныйСчет;
	КредитныйИнструмент = ЭтотОбъект.МНО;
	
	СчетУчетаДоходов = ПланыСчетов.Единый.НайтиПоКоду(УчетныйАктив.АналитикаДоходовОтОпераций.НомерСчетаБухгалтерскогоУчета);
	СчетУчетаРасходов = ПланыСчетов.Единый.НайтиПоКоду(УчетныйАктив.АналитикаРасходовОтОпераций.НомерСчетаБухгалтерскогоУчета);
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ДепозитныеВклады);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОстатки.СуммаОстатокДт - БухгалтерскийУчетОстатки.СуммаОстатокКт КАК ОстатокКорректировки,
		|	БухгалтерскийУчетОстатки.Субконто2 КАК КредитныйИнструмент
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В (&СчетУчетаКорректировокА, &СчетУчетаКорректировокП),
		|			&ВидыСубконто,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 = &БанковскиеСчета
		|				И Субконто2 = &КредитныйИнструмент) КАК БухгалтерскийУчетОстатки";
	
	Запрос.УстановитьПараметр("БанковскиеСчета"				, БанковскийСчет);
	Запрос.УстановитьПараметр("ВидыСубконто"				, ВидыСубконто);
	Запрос.УстановитьПараметр("КредитныйИнструмент"			, КредитныйИнструмент);
	Запрос.УстановитьПараметр("Организация"					, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период"						, Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетУчетаКорректировокА"		, УчетныйАктив.СчетУчетаКорректировокА);
	Запрос.УстановитьПараметр("СчетУчетаКорректировокП"		, УчетныйАктив.СчетУчетаКорректировокП);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Если ВыборкаДетальныеЗаписи.ОстатокКорректировки > 0 Тогда
			СуммаКорректировки = ВыборкаДетальныеЗаписи.ОстатокКорректировки;
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаКорректировки, "Корректировка");
			
			Проводка.СчетДт = ПланыСчетов.Единый.ВыбытиеИРеализация17;
			Проводка.СубконтоДт.ЦенныеБумаги = БанковскийСчет;
			Проводка.СубконтоДт.ОснованиеРасчетов = КредитныйИнструмент;
			
			Проводка.СчетКт = УчетныйАктив.СчетУчетаКорректировокА;
			Проводка.СубконтоКт.БанковскиеСчета = БанковскийСчет;
			Проводка.СубконтоКт.ДепозитныеВклады = КредитныйИнструмент;
			Проводка.ВалютаКт  = БанковскийСчет.Валюта;
			Проводка.ВалютнаяСуммаКт = СуммаКорректировки;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.ОстатокКорректировки < 0 Тогда
			
			СуммаКорректировки = -ВыборкаДетальныеЗаписи.ОстатокКорректировки;
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаКорректировки, "Корректировка");
			
			Проводка.СчетДт = УчетныйАктив.СчетУчетаКорректировокП;
			Проводка.СубконтоДт.БанковскиеСчета = БанковскийСчет;
			Проводка.СубконтоДт.ДепозитныеВклады = КредитныйИнструмент;
			Проводка.ВалютаДт  = БанковскийСчет.Валюта;
			Проводка.ВалютнаяСуммаДт = СуммаКорректировки;
			
			Проводка.СчетКт = ПланыСчетов.Единый.ВыбытиеИРеализация17;
			Проводка.СубконтоКт.ЦенныеБумаги = БанковскийСчет;
			Проводка.СубконтоКт.ОснованиеРасчетов = КредитныйИнструмент;
			
		КонецЕсли;
		
		СуммаСторнированияКорректировки = ВыборкаДетальныеЗаписи.ОстатокКорректировки;
		
	КонецЕсли;
	
	Возврат СуммаСторнированияКорректировки;

КонецФункции

Функция ВернутьНачисленныеПроцентыМНО(Период, СчетУчетаПроцентовПоМНО, Организация, СчетДоверительногоУправления, ВидыСубконто, МассивСубконто)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОстатки.СуммаОстатокДт
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = &СчетУчетаПроцентовПоМНО,
		|			&ВидыСубконто,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
		|				И Субконто1 = &Субконто1) КАК БухгалтерскийУчетОстатки";

	Запрос.УстановитьПараметр("Период",                       Период);
	Запрос.УстановитьПараметр("СчетУчетаПроцентовПоМНО",	  СчетУчетаПроцентовПоМНО);
	Запрос.УстановитьПараметр("ВидыСубконто",				  ВидыСубконто);
	Запрос.УстановитьПараметр("Организация",                  Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(СчетДоверительногоУправления));

	СтрокаУсловияСубконто = "";
	Для Инд = 1 По МассивСубконто.Количество() Цикл
		
		СтрокаСубконто = СтрШаблон("Субконто%1", Инд);
		
		Запрос.УстановитьПараметр(СтрокаСубконто, МассивСубконто[Инд - 1]);
		
		СтрокаУсловияСубконто = СтрокаУсловияСубконто + СтрШаблон(" И %1 = &%1", СтрокаСубконто);
		
	КонецЦикла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Субконто1 = &Субконто1", СтрокаУсловияСубконто);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НачисленоПроцентов = ВыборкаДетальныеЗаписи.СуммаОстатокДт;
	Иначе
		НачисленоПроцентов = 0;
	КонецЕсли;
	
	Возврат НачисленоПроцентов;

КонецФункции 

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт

	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	ДанныеМНО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.МНО, "Дата,РасчетныйСчет,Сумма");
	ДанныеСчетаМНО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеМНО.РасчетныйСчет, "Банк,Валюта");
	Контрагент = ДанныеСчетаМНО.Банк.ЮрФизЛицо;
	
	УчетныйАктив = Справочники.УчетныеАктивыЕПС.ПроцентыНаМНО;
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ДанныеМНО.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);

	СуммаСторнированияКорректировки = ОтсторнироватьКорректировку();
	
	ВидыСубконто = Новый Массив;
	МассивСубконто = Новый Массив;
	
	Если НастройкиУчета.СчетУчетаПроцентовПоМНО = ПланыСчетов.Единый.Расчеты Тогда // 474
		
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов);
		
		МассивСубконто.Добавить(Контрагент);
		МассивСубконто.Добавить(ЭтотОбъект.МНО);
		
		СчетУчетаПроцентовПоМНО = ПланыСчетов.Единый.Расчеты23;
		
	ИначеЕсли НастройкиУчета.СчетУчетаПроцентовПоМНО = ПланыСчетов.Единый.РасчетныеСчета Тогда // 205
		
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета);
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов);
		
		МассивСубконто.Добавить(ДанныеМНО.РасчетныйСчет);
		МассивСубконто.Добавить(ЭтотОбъект.МНО);
		
		СчетУчетаПроцентовПоМНО = ПланыСчетов.Единый.РасчетныеСчета07;
	
	Иначе // 206
		
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов);
		
		МассивСубконто.Добавить(Контрагент);
		МассивСубконто.Добавить(ЭтотОбъект.МНО);
		
		СчетУчетаПроцентовПоМНО = УчетныйАктив.СчетУчетаПереоценкиА;
	
	КонецЕсли;
	
	НачисленоПроцентов = ВернутьНачисленныеПроцентыМНО(ЭтотОбъект.Дата, СчетУчетаПроцентовПоМНО, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ВидыСубконто, МассивСубконто);
	
	Если НачисленоПроцентов <> 0 Тогда //сторнируем %
		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(НачисленоПроцентов, ДанныеСчетаМНО.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
		// 61217 20603
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Расторжение МНО");
				
		Проводка.СчетДт = ПланыСчетов.Единый.ВыбытиеИРеализация17;
		Проводка.СубконтоДт.ЦенныеБумаги		= ДанныеМНО.РасчетныйСчет;
		Проводка.СубконтоДт.ОснованиеРасчетов	= ЭтотОбъект.МНО;
		
		Если НастройкиУчета.СчетУчетаПроцентовПоМНО = ПланыСчетов.Единый.Расчеты Тогда // 474
			
			Проводка.СчетКт = ПланыСчетов.Единый.Расчеты23;
			
			Проводка.СубконтоКт.Контрагенты						= Контрагент;
			Проводка.СубконтоКт.ОснованиеРасчетов				= ЭтотОбъект.МНО;
			
			Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.МНО;
			
		ИначеЕсли НастройкиУчета.СчетУчетаПроцентовПоМНО = ПланыСчетов.Единый.РасчетныеСчета Тогда // 205
			
			Проводка.СчетКт = ПланыСчетов.Единый.РасчетныеСчета07;
			
			Проводка.СубконтоКт.БанковскиеСчета					= ДанныеМНО.РасчетныйСчет;
			Проводка.СубконтоКт.УсловияЗаймовКредитовИДепозитов	= ЭтотОбъект.МНО;
			
		Иначе // 206
			
			Проводка.СчетКт = УчетныйАктив.СчетУчетаПереоценкиА;
			
			Проводка.СубконтоКт.Контрагенты						= Контрагент;
			Проводка.СубконтоКт.УсловияЗаймовКредитовИДепозитов	= ЭтотОбъект.МНО;
			
		КонецЕсли;
			
		
		Проводка.ВалютаКт		 	= ДанныеСчетаМНО.Валюта;
		Проводка.ВалютнаяСуммаКт	= НачисленоПроцентов;
		
		// 71502/41214 61217
		ЗакрытьРасходов = НачисленоПроцентов + СуммаСторнированияКорректировки;
		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЗакрытьРасходов, ДанныеСчетаМНО.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Расторжение МНО");
		
		Проводка.СчетДт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций02;
		Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов	= БухгалтерскийУчет.ОпределитьГруппуФинансовогоУчетаДоходовРасходов("41214");
		Проводка.СубконтоДт.ЦенныеБумаги							= ДанныеМНО.РасчетныйСчет;
		
		Проводка.СчетКт = ПланыСчетов.Единый.ВыбытиеИРеализация17;
		Проводка.СубконтоКт.ЦенныеБумаги		= ДанныеМНО.РасчетныйСчет;
		Проводка.СубконтоКт.ОснованиеРасчетов	= ЭтотОбъект.МНО;
		
		
		Если БухгалтерскийУчет.Закрывать7ойРазделПриПоступленииДенежныхСредств(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления) Тогда
		
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Расторжение МНО");
			
			Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоДт.Договоры = ЭтотОбъект.СчетДоверительногоУправления;
			
			Проводка.СчетКт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций02;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = БухгалтерскийУчет.ОпределитьГруппуФинансовогоУчетаДоходовРасходов("41214");
			Проводка.СубконтоКт.ЦенныеБумаги = ДанныеМНО.РасчетныйСчет;
			
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, НачисленоПроцентов, "Расторжение МНО");
			
			Проводка.СчетДт = ПланыСчетов.Единый.ПроцентныеДоходы01;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = БухгалтерскийУчет.ОпределитьГруппуФинансовогоУчетаДоходовРасходов("3112", Новый Структура("Банк, Период", ДанныеМНО.РасчетныйСчет.Банк, ЭтотОбъект.Дата));
			Проводка.СубконтоДт.ЦенныеБумаги = ЭтотОбъект.МНО.РасчетныйСчет;
			
			Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоКт.Договоры = ЭтотОбъект.СчетДоверительногоУправления;
		
		КонецЕсли;
		
	КонецЕсли;

	Если НастройкиУчета.БлокироватьДенежныеСредстваПоДоговоруМНО = Неопределено Тогда
	
		НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);	
	
	КонецЕсли;
	
	Если НастройкиУчета.БлокироватьДенежныеСредстваПоДоговоруМНО Тогда
	
		СуммаМНО = ДанныеМНО.Сумма;
		Валюта = ДанныеСчетаМНО.Валюта;
		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаМНО, Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		АналитикаМНО = Справочники.ДополнительныеАналитикиЛицевыхСчетов.МНО;	
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Окончание соглашения МНО");
		
		Если Справочники.Банки.ЯвляетсяРезидентом(ДанныеСчетаМНО.Банк, Дата) Тогда
			Проводка.СчетДт = ПланыСчетов.Единый.РасчетныеСчета01;
		Иначе
			Проводка.СчетДт = ПланыСчетов.Единый.РасчетныеСчета02;
		КонецЕсли;
		Проводка.СубконтоДт.БанковскиеСчета = ДанныеМНО.РасчетныйСчет;
		Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.МНО;
		
		Проводка.ВалютаДт  = Валюта;
		Проводка.ВалютнаяСуммаДт = СуммаМНО;
		
		Проводка.СчетКт = Проводка.СчетДт;
		Проводка.СубконтоКт.БанковскиеСчета = ДанныеМНО.РасчетныйСчет;
		Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.МНО;
		
		Проводка.ДополнительнаяАналитикаКт = АналитикаМНО;
		
		Проводка.ВалютаКт  = Валюта;
		Проводка.ВалютнаяСуммаКт = СуммаМНО;
		
	КонецЕсли;
	
	
	МассивУчетныхАктивов = Новый Массив;
	МассивУчетныхАктивов.Добавить(УчетныйАктив);
	
	МассивМНО = Новый Массив;
	МассивМНО.Добавить(ЭтотОбъект.МНО);
	
	БухгалтерскийУчетЕПС.ЗакрытьПарныеСчетаДоходовРасходов(ЭтотОбъект, МассивУчетныхАктивов, Ложь, Истина, МассивМНО, Отказ);
		
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт

	Движения[УчетныйРегистр].Записывать = Истина;
	
	СчетУчетаАктивов = БухгалтерскийУчет.ОпределитьСчетУчетаАктивов(
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.МНО.СчетДоверительногоУправления,
		Справочники.УчетныеАктивы.ПроцентыНаМНО,
		УчетныйРегистр);
		
	// Расчет суммы начисл. процентов
	ВидыСубконто = Новый Массив;
    ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.МНО);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОстатки.СуммаОстатокДт
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПроцентыПоМинимальномуНеснижаемомуОстатку),
		|			&ВидыСубконто,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
		|				И Субконто1 = &МНО) КАК БухгалтерскийУчетОстатки";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);
		
	Запрос.УстановитьПараметр("Период",                       ЭтотОбъект.Дата);	
	Запрос.УстановитьПараметр("ВидыСубконто",                 ВидыСубконто);
	Запрос.УстановитьПараметр("МНО",                          ЭтотОбъект.МНО);
	Запрос.УстановитьПараметр("Организация",                  ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.МНО.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.МНО.СчетДоверительногоУправления));

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НачисленоПроцентов = ВыборкаДетальныеЗаписи.СуммаОстатокДт;
	Иначе
		НачисленоПроцентов = 0;
	КонецЕсли;
		
	Если НачисленоПроцентов > 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], -НачисленоПроцентов, "Строниров процентов по МНО");
		
		// Дебет
		Проводка.СчетДт = СчетУчетаАктивов;
		Проводка.СубконтоДт.МНО = ЭтотОбъект.МНО;
		
		// Кредит
		Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
		Проводка.СубконтоКт.ПрочиеДоходыИРасходы = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(
			ЭтотОбъект.Дата, 
			ЭтотОбъект.Организация, 
			ЭтотОбъект.МНО.СчетДоверительногоУправления,
			Справочники.УчетныеАктивы.ПроцентыНаМНО,
			УчетныйРегистр,
			"АналитикаДоходов");
		Проводка.СубконтоКт.ЦенныеБумаги = ЭтотОбъект.МНО;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.МНО") Тогда
		
		ЭтотОбъект.МНО = ДанныеЗаполнения;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация, СчетДоверительногоУправления");
		
	Конецесли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ЭтотОбъект.МНО = Документы.МНО.ПустаяСсылка();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);	
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти
